In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# Date Time Indexing
import pandas as pd
# Load data from a CSV file
df = pd.read_csv('Employe_Performance_dataset.csv')

In [3]:
df

,ID,Name,Age,Gender,Department,Salary,Joining Date,Performance Score,Experience,Status,Location,Session
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,New York,Night
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Inactive,Los Angeles,Evening
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,1,Inactive,New York,Morning
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Inactive,Los Angeles,Evening
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Inactive,New York,Evening
...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,Pamela Reeves,49,Female,Sales,7652,2024-06-23,4.0,3,Active,Los Angeles,Evening
996,997,Todd Johnson,29,Female,Sales,6754,2018-07-20,NaN,12,Inactive,New York,Morning
997,998,Michael Sanchez,18,Male,Sales,5278,2023-07-05,5.0,3,Active,New York,Morning
998,999,Ashley Taylor,51,Female,IT,5437,2022-02-18,4.0,9,Inactive,Los Angeles,Evening
999,1000,Shawn Scott,45,Male,IT,7364,2022-07-31,2.0,4,Active,New York,Morning

In [4]:
#Question 1 Load the dataset into a Pandas DataFrame and display the first 10 rows.

In [5]:
df.head(10)

,ID,Name,Age,Gender,Department,Salary,Joining Date,Performance Score,Experience,Status,Location,Session
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.0,16,Active,New York,Night
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.0,11,Inactive,Los Angeles,Evening
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,NaN,1,Inactive,New York,Morning
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.0,13,Inactive,Los Angeles,Evening
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.0,16,Inactive,New York,Evening
5,6,Ashley Howe,29,Female,HR,2591,2016-06-24,1.0,6,Active,Chicago,Evening
6,7,David Olson,39,Female,Sales,6826,2023-05-11,NaN,4,Active,New York,Night
7,8,Amanda Baker,52,Other,HR,6285,2015-04-01,NaN,8,Inactive,Chicago,Evening
8,9,Jeremy Wright,63,Female,Sales,9862,2024-02-07,NaN,3,Inactive,New York,Night
9,10,Brian Faulkner,30,Male,IT,8202,2018-05-26,1.0,9,Active,Los Angeles,Morning

#Question 2 What are the column names and their respective data types in the dataset

In [6]:
# Convert columns to specific data types
df["Age"] = df["Age"].astype(int)  # Convert Age to integer
df["Salary"] = df["Salary"].astype(float)  # Convert Salary to float
df["Joining Date"] = pd.to_datetime(df["Joining Date"])  # Convert Joining Date to datetime

print("\nUpdated Data Types:")
print(df.dtypes)

Updated Data Types:
ID                            int64
Name                         object
Age                           int32
Gender                       object
Department                   object
Salary                      float64
Joining Date         datetime64[ns]
Performance Score           float64
Experience                    int64
Status                       object
Location                     object
Session                      object
dtype: object

In [7]:
How many rows and columns are there in the dataset?

Object `dataset` not found.

In [8]:
df.shape

(1000, 12)

In [9]:
rows, columns = df.shape  # Unpack rows and columns
print(f"The dataset has {rows} rows and {columns} columns.")

The dataset has 1000 rows and 12 columns.

In [10]:
#Question 3  Select the Name, Age, and Salary columns using df[].

In [11]:
selected_columns = df[['Name', 'Age', 'Salary']]
print(selected_columns)

                   Name  Age  Salary
0          Cory Escobar   48  5641.0
1       Timothy Sanchez   25  4249.0
2          Chad Nichols   57  3058.0
3    Christine Williams   58  5895.0
4          Amber Harris   35  4317.0
..                  ...  ...     ...
995       Pamela Reeves   49  7652.0
996        Todd Johnson   29  6754.0
997     Michael Sanchez   18  5278.0
998       Ashley Taylor   51  5437.0
999         Shawn Scott   45  7364.0

[1000 rows x 3 columns]

In [12]:
#Question 4 Select the first 5 rows of the DataFrame using the iloc method.

In [13]:
first_five_rows = df.iloc[:5, [1, 2, 5]]  # Columns by index: 1 = Name, 2 = Age, 5 = Salary
print(first_five_rows)

                 Name  Age  Salary
0        Cory Escobar   48  5641.0
1     Timothy Sanchez   25  4249.0
2        Chad Nichols   57  3058.0
3  Christine Williams   58  5895.0
4        Amber Harris   35  4317.0

In [14]:
# Question 6. Select all rows where the Department is "Sales" using the loc method.

In [15]:
sales_department = df.loc[df['Department'] == 'Sales']
print(sales_department)

      ID             Name  Age  Gender Department  Salary Joining Date  \
1      2  Timothy Sanchez   25   Other      Sales  4249.0   2020-11-09
2      3     Chad Nichols   57   Other      Sales  3058.0   2019-02-12
6      7      David Olson   39  Female      Sales  6826.0   2023-05-11
8      9    Jeremy Wright   63  Female      Sales  9862.0   2024-02-07
10    11      Nicole Bell   42  Female      Sales  5336.0   2015-01-28
..   ...              ...  ...     ...        ...     ...          ...
991  992  William Schultz   23   Other      Sales  4311.0   2019-08-17
992  993   Ashley Daniels   25   Other      Sales  5524.0   2022-11-24
995  996    Pamela Reeves   49  Female      Sales  7652.0   2024-06-23
996  997     Todd Johnson   29  Female      Sales  6754.0   2018-07-20
997  998  Michael Sanchez   18    Male      Sales  5278.0   2023-07-05

     Performance Score  Experience    Status     Location  Session
1                  2.0          11  Inactive  Los Angeles  Evening
2                  NaN           1  Inactive     New York  Morning
6                  NaN           4    Active     New York    Night
8                  NaN           3  Inactive     New York    Night
10                 3.0           7    Active  Los Angeles  Evening
..                 ...         ...       ...          ...      ...
991                NaN          10  Inactive  Los Angeles  Evening
992                NaN           8  Inactive     New York  Morning
995                4.0           3    Active  Los Angeles  Evening
996                NaN          12  Inactive     New York  Morning
997                5.0           3    Active     New York  Morning

[338 rows x 12 columns]

In [16]:
sales_column = df['Salary']  # Assuming you meant 'Salary' as there’s no 'Sales' column.
print(sales_column)

0      5641.0
1      4249.0
2      3058.0
3      5895.0
4      4317.0
        ...
995    7652.0
996    6754.0
997    5278.0
998    5437.0
999    7364.0
Name: Salary, Length: 1000, dtype: float64

In [17]:
# Question 7 Select rows where the Salary is greater than 8000 and Status is "Active"

In [18]:
filtered_rows = df.loc[(df['Salary'] > 8000) & (df['Status'] == 'Active')]
print(filtered_rows)

      ID             Name  Age  Gender Department  Salary Joining Date  \
9     10   Brian Faulkner   30    Male         IT  8202.0   2018-05-26
24    25    Tracy Carlson   21    Male         HR  9275.0   2022-04-09
38    39     Jordan Scott   33   Other      Sales  8678.0   2016-05-15
39    40      Lisa Wagner   36    Male         HR  8870.0   2024-08-12
60    61   Andrew Shannon   51   Other      Sales  8544.0   2020-02-08
..   ...              ...  ...     ...        ...     ...          ...
976  977    Kimberly Ross   19    Male      Sales  9331.0   2018-07-03
982  983    Stephen Ponce   46   Other      Sales  8696.0   2022-10-14
986  987  Melissa Bradley   39  Female         IT  9618.0   2015-07-05
988  989   Hannah Hickman   36  Female         IT  9118.0   2022-07-02
989  990    Shannon Meyer   18   Other         HR  9985.0   2022-11-05

     Performance Score  Experience  Status     Location  Session
9                  1.0           9  Active  Los Angeles  Morning
24                 4.0          12  Active     New York  Morning
38                 5.0           9  Active  Los Angeles  Evening
39                 4.0          17  Active  Los Angeles  Evening
60                 NaN           6  Active     New York  Evening
..                 ...         ...     ...          ...      ...
976                5.0          12  Active     New York  Morning
982                4.0           1  Active     New York  Evening
986                1.0          13  Active     New York  Morning
988                5.0           5  Active     New York    Night
989                4.0          18  Active      Chicago    Night

[112 rows x 12 columns]

In [19]:
print(df)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR  5641.0   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales  4249.0   2020-11-09
2       3        Chad Nichols   57   Other      Sales  3058.0   2019-02-12
3       4  Christine Williams   58  Female         IT  5895.0   2017-09-08
4       5        Amber Harris   35   Other         IT  4317.0   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
995   996       Pamela Reeves   49  Female      Sales  7652.0   2024-06-23
996   997        Todd Johnson   29  Female      Sales  6754.0   2018-07-20
997   998     Michael Sanchez   18    Male      Sales  5278.0   2023-07-05
998   999       Ashley Taylor   51  Female         IT  5437.0   2022-02-18
999  1000         Shawn Scott   45    Male         IT  7364.0   2022-07-31

     Performance Score  Experience    Status     Location  Session
0                  2.0          16    Active     New York    Night
1                  2.0          11  Inactive  Los Angeles  Evening
2                  NaN           1  Inactive     New York  Morning
3                  2.0          13  Inactive  Los Angeles  Evening
4                  5.0          16  Inactive     New York  Evening
..                 ...         ...       ...          ...      ...
995                4.0           3    Active  Los Angeles  Evening
996                NaN          12  Inactive     New York  Morning
997                5.0           3    Active     New York  Morning
998                4.0           9  Inactive  Los Angeles  Evening
999                2.0           4    Active     New York  Morning

[1000 rows x 12 columns]

In [20]:
# Question 8.Extract the rows where the employee has been with the company for more than 5 years and has a Performance Score of at least 4.

This code uses the loc[] method to filter the rows based on two conditions:

1) Experience > 5: The employee has been with the company for more than 5 years.
2) Performance Score >= 4: The employee has a Performance Score of at least 4

In [21]:
# Filter the rows based on the given conditions
filtered_rows = df.loc[(df['Experience'] > 5) & (df['Performance Score'] >= 4)]

# Print the filtered rows
print(filtered_rows)

      ID                Name  Age  Gender Department  Salary Joining Date  \
4      5        Amber Harris   35   Other         IT  4317.0   2020-02-15
11    12   Rodney Richardson   60   Other         HR  6908.0   2015-03-14
17    18  Jacqueline Randall   31  Female         HR  3519.0   2018-05-18
18    19      Nancy Stephens   38    Male         HR  9061.0   2017-07-16
24    25       Tracy Carlson   21    Male         HR  9275.0   2022-04-09
..   ...                 ...  ...     ...        ...     ...          ...
978  979         Michael Lee   18  Female         IT  6086.0   2019-05-30
989  990       Shannon Meyer   18   Other         HR  9985.0   2022-11-05
990  991        Amy Johnston   53  Female         HR  3991.0   2024-09-03
993  994       Brandon Bruce   31  Female         HR  3371.0   2018-09-25
998  999       Ashley Taylor   51  Female         IT  5437.0   2022-02-18

     Performance Score  Experience    Status     Location  Session
4                  5.0          16  Inactive     New York  Evening
11                 4.0          19    Active      Chicago    Night
17                 4.0           6    Active     New York  Morning
18                 5.0          16  Inactive      Chicago    Night
24                 4.0          12    Active     New York  Morning
..                 ...         ...       ...          ...      ...
978                4.0           7  Inactive  Los Angeles  Evening
989                4.0          18    Active      Chicago    Night
990                4.0           8    Active      Chicago  Morning
993                5.0          12  Inactive      Chicago    Night
998                4.0           9  Inactive  Los Angeles  Evening

[137 rows x 12 columns]

In [22]:
# Question 9  Select every alternate row from the DataFrame using slicing with iloc.

In [23]:
# Select every alternate row using iloc
alternate_rows = df.iloc[::2]

# Print the result
print(alternate_rows)

      ID             Name  Age  Gender Department  Salary Joining Date  \
0      1     Cory Escobar   48  Female         HR  5641.0   2015-05-03
2      3     Chad Nichols   57   Other      Sales  3058.0   2019-02-12
4      5     Amber Harris   35   Other         IT  4317.0   2020-02-15
6      7      David Olson   39  Female      Sales  6826.0   2023-05-11
8      9    Jeremy Wright   63  Female      Sales  9862.0   2024-02-07
..   ...              ...  ...     ...        ...     ...          ...
990  991     Amy Johnston   53  Female         HR  3991.0   2024-09-03
992  993   Ashley Daniels   25   Other      Sales  5524.0   2022-11-24
994  995  Rachel Phillips   22    Male         IT  3096.0   2018-10-27
996  997     Todd Johnson   29  Female      Sales  6754.0   2018-07-20
998  999    Ashley Taylor   51  Female         IT  5437.0   2022-02-18

     Performance Score  Experience    Status     Location  Session
0                  2.0          16    Active     New York    Night
2                  NaN           1  Inactive     New York  Morning
4                  5.0          16  Inactive     New York  Evening
6                  NaN           4    Active     New York    Night
8                  NaN           3  Inactive     New York    Night
..                 ...         ...       ...          ...      ...
990                4.0           8    Active      Chicago  Morning
992                NaN           8  Inactive     New York  Morning
994                2.0           7  Inactive      Chicago  Evening
996                NaN          12  Inactive     New York  Morning
998                4.0           9  Inactive  Los Angeles  Evening

[500 rows x 12 columns]

In [24]:
# Question 10 . Retrieve rows where the employee belongs to "Sales" and has a Salary in the top 10% of all salaries.

In [25]:
# Filter the DataFrame for rows where the Department is 'Sales'
sales_data = df[df['Department'] == 'Sales']

# Calculate the 90th percentile of the Salary column
salary_threshold = sales_data['Salary'].quantile(0.9)

# Filter rows where Salary is in the top 10%
top_10_sales = sales_data[sales_data['Salary'] >= salary_threshold]

# Display the Sales column (or Salary column)
print(top_10_sales['Salary'])

8      9862.0
22     9598.0
29     9661.0
215    9377.0
228    9139.0
239    9356.0
250    9924.0
263    9455.0
275    9749.0
299    9375.0
379    9726.0
381    9269.0
405    9505.0
442    9146.0
459    8957.0
491    9181.0
516    9630.0
552    9704.0
591    9323.0
594    9906.0
629    9364.0
664    9053.0
742    9409.0
756    9666.0
758    9917.0
778    9653.0
796    9926.0
820    8949.0
844    9693.0
898    9819.0
903    9658.0
932    9616.0
937    9963.0
976    9331.0
Name: Salary, dtype: float64

In [26]:
#Question 11  Replace all "Inactive" values in the Status column with "Retired".

In [27]:
# Replace all "Inactive" values in the 'Status' column with "Retired"
df['Status'] = df['Status'].replace('Inactive', 'Retired')

# Check the updated DataFrame
print(df.head())

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR  5641.0   2015-05-03
1   2     Timothy Sanchez   25   Other      Sales  4249.0   2020-11-09
2   3        Chad Nichols   57   Other      Sales  3058.0   2019-02-12
3   4  Christine Williams   58  Female         IT  5895.0   2017-09-08
4   5        Amber Harris   35   Other         IT  4317.0   2020-02-15

   Performance Score  Experience   Status     Location  Session
0                2.0          16   Active     New York    Night
1                2.0          11  Retired  Los Angeles  Evening
2                NaN           1  Retired     New York  Morning
3                2.0          13  Retired  Los Angeles  Evening
4                5.0          16  Retired     New York  Evening

In [28]:
# Question 12  Add a new column Bonus where values are 10% of the Salary column.

In [29]:
# Add a new column 'Bonus' that is 10% of the 'Salary' column
df['Bonus'] = df['Salary'] * 0.10

# Check the updated DataFrame
print(df.head())

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR  5641.0   2015-05-03
1   2     Timothy Sanchez   25   Other      Sales  4249.0   2020-11-09
2   3        Chad Nichols   57   Other      Sales  3058.0   2019-02-12
3   4  Christine Williams   58  Female         IT  5895.0   2017-09-08
4   5        Amber Harris   35   Other         IT  4317.0   2020-02-15

   Performance Score  Experience   Status     Location  Session  Bonus
0                2.0          16   Active     New York    Night  564.1
1                2.0          11  Retired  Los Angeles  Evening  424.9
2                NaN           1  Retired     New York  Morning  305.8
3                2.0          13  Retired  Los Angeles  Evening  589.5
4                5.0          16  Retired     New York  Evening  431.7

In [30]:
# 13. Update the Performance Score of employees in the "IT" department to 5 if it is NaN.

In [31]:
# Update Performance Score to 5 where it is NaN in the 'IT' department
df.loc[(df['Department'] == 'IT') & (df['Performance Score'].isna()), 'Performance Score'] = 5

# Check the updated DataFrame
print(df.head())

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR  5641.0   2015-05-03
1   2     Timothy Sanchez   25   Other      Sales  4249.0   2020-11-09
2   3        Chad Nichols   57   Other      Sales  3058.0   2019-02-12
3   4  Christine Williams   58  Female         IT  5895.0   2017-09-08
4   5        Amber Harris   35   Other         IT  4317.0   2020-02-15

   Performance Score  Experience   Status     Location  Session  Bonus
0                2.0          16   Active     New York    Night  564.1
1                2.0          11  Retired  Los Angeles  Evening  424.9
2                NaN           1  Retired     New York  Morning  305.8
3                2.0          13  Retired  Los Angeles  Evening  589.5
4                5.0          16  Retired     New York  Evening  431.7

In [32]:
#df['Experience'] < 2 identifies rows where the Experience is less than 2.
#df.loc[...] selects these rows, and the Experience column is updated to 2 for those rows.

In [33]:
# Update Experience to 2 for employees with less than 2 years
df.loc[df['Experience'] < 2, 'Experience'] = 2

# Check the updated DataFrame
print(df.head())

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR  5641.0   2015-05-03
1   2     Timothy Sanchez   25   Other      Sales  4249.0   2020-11-09
2   3        Chad Nichols   57   Other      Sales  3058.0   2019-02-12
3   4  Christine Williams   58  Female         IT  5895.0   2017-09-08
4   5        Amber Harris   35   Other         IT  4317.0   2020-02-15

   Performance Score  Experience   Status     Location  Session  Bonus
0                2.0          16   Active     New York    Night  564.1
1                2.0          11  Retired  Los Angeles  Evening  424.9
2                NaN           2  Retired     New York  Morning  305.8
3                2.0          13  Retired  Los Angeles  Evening  589.5
4                5.0          16  Retired     New York  Evening  431.7

In [34]:
#Question 14. Modify the Experience of employees with less than 2 years to 2.

In [35]:
#df['Experience'] < 2 identifies rows where the Experience is less than 2.
#df.loc[...] selects these rows, and the Experience column is updated to 2 for those rows.

In [36]:
# Update Experience to 2 for employees with less than 2 years
df.loc[df['Experience'] < 2, 'Experience'] = 2

# Check the updated DataFrame
print(df.head())

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR  5641.0   2015-05-03
1   2     Timothy Sanchez   25   Other      Sales  4249.0   2020-11-09
2   3        Chad Nichols   57   Other      Sales  3058.0   2019-02-12
3   4  Christine Williams   58  Female         IT  5895.0   2017-09-08
4   5        Amber Harris   35   Other         IT  4317.0   2020-02-15

   Performance Score  Experience   Status     Location  Session  Bonus
0                2.0          16   Active     New York    Night  564.1
1                2.0          11  Retired  Los Angeles  Evening  424.9
2                NaN           2  Retired     New York  Morning  305.8
3                2.0          13  Retired  Los Angeles  Evening  589.5
4                5.0          16  Retired     New York  Evening  431.7

In [37]:
#Question 15. Normalize the Salary column so that all values are between 0 and 1.

In [38]:
#df['Salary'].min() gets the minimum value of the Salary column.
#df['Salary'].max() gets the maximum value of the Salary column.
#The formula (value - min) / (max - min) scales each value in the column to a range between 0 and 1.

In [39]:
# Normalize the Salary column
df['Salary_Normalized'] = (df['Salary'] - df['Salary'].min()) / (df['Salary'].max() - df['Salary'].min())

# Check the updated DataFrame
print(df[['Salary', 'Salary_Normalized']].head())

   Salary  Salary_Normalized
0  5641.0           0.454500
1  4249.0           0.280020
2  3058.0           0.130735
3  5895.0           0.486337
4  4317.0           0.288543

In [40]:
# Question 16. Replace all Location values with "Remote" for employees with a Performance Score below 3.

In [41]:
# Replace Location with "Remote" for employees with Performance Score below 3
df.loc[df['Performance Score'] < 3, 'Location'] = 'Remote'

# Check the updated DataFrame
print(df[['Performance Score', 'Location']].head(10))

   Performance Score  Location
0                2.0    Remote
1                2.0    Remote
2                NaN  New York
3                2.0    Remote
4                5.0  New York
5                1.0    Remote
6                NaN  New York
7                NaN   Chicago
8                NaN  New York
9                1.0    Remote

In [42]:
#Question 17. Create a new column Experience Level with values "Junior", "Mid", or "Senior" based on the Experience.

In [43]:
#pd.cut is used to segment and sort data values into bins.
#bins=[0, 5, 10, float('inf')] creates three bins:
#0 to less than 5: "Junior".
#5 to less than 10: "Mid".
#10 and above: "Senior".
#right=False ensures that the intervals are left-closed (e.g., [0, 5) includes 0 but excludes 5).
#The labels parameter assigns a corresponding label to each bin.

In [44]:
# Create a new column 'Experience Level' based on the 'Experience' column
df['Experience Level'] = pd.cut(
    df['Experience'],
    bins=[0, 5, 10, float('inf')],
    labels=['Junior', 'Mid', 'Senior'],
    right=False
)

# Display the first few rows to check the new column
print(df[['Experience', 'Experience Level']].head(10))

   Experience Experience Level
0          16           Senior
1          11           Senior
2           2           Junior
3          13           Senior
4          16           Senior
5           6              Mid
6           4           Junior
7           8              Mid
8           3           Junior
9           9              Mid

In [45]:
df['Experience Level']=pd.cut(df['Experience'],bins=[0,5,10,float('inf')],labels=['Junior','Mid','Senior'])
df.head()

,ID,Name,Age,Gender,Department,Salary,Joining Date,Performance Score,Experience,Status,Location,Session,Bonus,Salary_Normalized,Experience Level
0,1,Cory Escobar,48,Female,HR,5641.0,2015-05-03,2.0,16,Active,Remote,Night,564.1,0.454500,Senior
1,2,Timothy Sanchez,25,Other,Sales,4249.0,2020-11-09,2.0,11,Retired,Remote,Evening,424.9,0.280020,Senior
2,3,Chad Nichols,57,Other,Sales,3058.0,2019-02-12,NaN,2,Retired,New York,Morning,305.8,0.130735,Junior
3,4,Christine Williams,58,Female,IT,5895.0,2017-09-08,2.0,13,Retired,Remote,Evening,589.5,0.486337,Senior
4,5,Amber Harris,35,Other,IT,4317.0,2020-02-15,5.0,16,Retired,New York,Evening,431.7,0.288543,Senior

In [46]:
#Question 18. Add a new row with specific values using the append() method.

In [47]:
# Define a dictionary with the values for the new row
new_row = {
    'ID': 1001,
    'Name': 'John Doe',
    'Age': 30,
    'Gender': 'Male',
    'Department': 'HR',
    'Salary': 5000,
    'Joining Date': '2022-01-15',
    'Performance Score': 3.0,
    'Experience': 3,
    'Status': 'Active',
    'Location': 'Remote',
    'Session': 'Morning',
    'Bonus': 500,  # Assuming 10% of salary
    'Experience Level': 'Mid'
}

# Convert the dictionary to a DataFrame
new_row_df = pd.DataFrame([new_row])

# Concatenate the new row to the existing DataFrame
df = pd.concat([df, new_row_df], ignore_index=True)

# Display the last few rows to verify the addition
print(df.tail())

        ID             Name  Age  Gender Department  Salary  \
996    997     Todd Johnson   29  Female      Sales  6754.0
997    998  Michael Sanchez   18    Male      Sales  5278.0
998    999    Ashley Taylor   51  Female         IT  5437.0
999   1000      Shawn Scott   45    Male         IT  7364.0
1000  1001         John Doe   30    Male         HR  5000.0

             Joining Date  Performance Score  Experience   Status  \
996   2018-07-20 00:00:00                NaN          12  Retired
997   2023-07-05 00:00:00                5.0           3   Active
998   2022-02-18 00:00:00                4.0           9  Retired
999   2022-07-31 00:00:00                2.0           4   Active
1000           2022-01-15                3.0           3   Active

         Location  Session  Bonus  Salary_Normalized Experience Level
996      New York  Morning  675.4           0.594009           Senior
997      New York  Morning  527.8           0.409000           Junior
998   Los Angeles  Evening  543.7           0.428930              Mid
999        Remote  Morning  736.4           0.670469           Junior
1000       Remote  Morning  500.0                NaN              Mid

In [48]:
#Question 19. Delete the column Session from the DataFrame.

In [49]:
# Delete the "Session" column
df = df.drop(columns=['Session'])

# Display the updated DataFrame
print(df.head())

   ID                Name  Age  Gender Department  Salary  \
0   1        Cory Escobar   48  Female         HR  5641.0
1   2     Timothy Sanchez   25   Other      Sales  4249.0
2   3        Chad Nichols   57   Other      Sales  3058.0
3   4  Christine Williams   58  Female         IT  5895.0
4   5        Amber Harris   35   Other         IT  4317.0

          Joining Date  Performance Score  Experience   Status  Location  \
0  2015-05-03 00:00:00                2.0          16   Active    Remote
1  2020-11-09 00:00:00                2.0          11  Retired    Remote
2  2019-02-12 00:00:00                NaN           2  Retired  New York
3  2017-09-08 00:00:00                2.0          13  Retired    Remote
4  2020-02-15 00:00:00                5.0          16  Retired  New York

   Bonus  Salary_Normalized Experience Level
0  564.1           0.454500           Senior
1  424.9           0.280020           Senior
2  305.8           0.130735           Junior
3  589.5           0.486337           Senior
4  431.7           0.288543           Senior

In [50]:
#Question 20. Delete rows where the Age is greater than 60.

In [51]:
# Delete rows where Age is greater than 60
df = df[df['Age'] <= 60]

#Display the updated DataFrame
print(df.head())

   ID                Name  Age  Gender Department  Salary  \
0   1        Cory Escobar   48  Female         HR  5641.0
1   2     Timothy Sanchez   25   Other      Sales  4249.0
2   3        Chad Nichols   57   Other      Sales  3058.0
3   4  Christine Williams   58  Female         IT  5895.0
4   5        Amber Harris   35   Other         IT  4317.0

          Joining Date  Performance Score  Experience   Status  Location  \
0  2015-05-03 00:00:00                2.0          16   Active    Remote
1  2020-11-09 00:00:00                2.0          11  Retired    Remote
2  2019-02-12 00:00:00                NaN           2  Retired  New York
3  2017-09-08 00:00:00                2.0          13  Retired    Remote
4  2020-02-15 00:00:00                5.0          16  Retired  New York

   Bonus  Salary_Normalized Experience Level
0  564.1           0.454500           Senior
1  424.9           0.280020           Senior
2  305.8           0.130735           Junior
3  589.5           0.486337           Senior
4  431.7           0.288543           Senior

In [52]:
#Question 21. Add a new column Age Group with values "Young", "Middle-aged", or "Senior" based on Age.

In [53]:
# Define the Age Group based on Age
def age_group(age):
    if age < 30:
        return 'Young'
    elif 30 <= age <= 50:
        return 'Middle-aged'
    else:
        return 'Senior'

# Add the new Age Group column
df['Age Group'] = df['Age'].apply(age_group)

# Display the updated DataFrame
print(df[['Age', 'Age Group']].head())

   Age    Age Group
0   48  Middle-aged
1   25        Young
2   57       Senior
3   58       Senior
4   35  Middle-aged

In [54]:
#Question 22. Identify all columns with missing values using the isna() method.

In [55]:
# Identify columns with missing values
missing_values = df.isna().sum()

# Display columns with missing values
print(missing_values[missing_values > 0])

Performance Score    291
Salary_Normalized      1
dtype: int64

In [56]:
#Question 23 Fill the missing values in Performance Score with the average score of that column.

In [57]:
#This will replace any NaN values in the Performance Score column with the mean of that column.

In [58]:
# Fill missing values in Performance Score with the average of the column
df['Performance Score'] = df['Performance Score'].fillna(df['Performance Score'].mean())

# Display the first few rows to verify the change
print(df.head())

   ID                Name  Age  Gender Department  Salary  \
0   1        Cory Escobar   48  Female         HR  5641.0
1   2     Timothy Sanchez   25   Other      Sales  4249.0
2   3        Chad Nichols   57   Other      Sales  3058.0
3   4  Christine Williams   58  Female         IT  5895.0
4   5        Amber Harris   35   Other         IT  4317.0

          Joining Date  Performance Score  Experience   Status  Location  \
0  2015-05-03 00:00:00           2.000000          16   Active    Remote
1  2020-11-09 00:00:00           2.000000          11  Retired    Remote
2  2019-02-12 00:00:00           3.441128           2  Retired  New York
3  2017-09-08 00:00:00           2.000000          13  Retired    Remote
4  2020-02-15 00:00:00           5.000000          16  Retired  New York

   Bonus  Salary_Normalized Experience Level    Age Group
0  564.1           0.454500           Senior  Middle-aged
1  424.9           0.280020           Senior        Young
2  305.8           0.130735           Junior       Senior
3  589.5           0.486337           Senior       Senior
4  431.7           0.288543           Senior  Middle-aged

Then we have to check if the missing values are replace

In [59]:
# Check if there are any missing values in the entire DataFrame
missing_values = df.isna().sum()

# Print the missing values for each column
print("Missing values in each column:")
print(missing_values)

# Check specifically for the 'Performance Score' column
missing_in_performance = df['Performance Score'].isna().sum()

print(f"\nMissing values in 'Performance Score' column: {missing_in_performance}")

Missing values in each column:
ID                   0
Name                 0
Age                  0
Gender               0
Department           0
Salary               0
Joining Date         0
Performance Score    0
Experience           0
Status               0
Location             0
Bonus                0
Salary_Normalized    1
Experience Level     0
Age Group            0
dtype: int64

Missing values in 'Performance Score' column: 0

In [60]:
#Question 24. Drop all rows with missing values using the dropna() method.

In [61]:
# Drop all rows with any missing values
df_cleaned = df.dropna()

# Display the first few rows of the cleaned DataFrame
print(df_cleaned.head())

   ID                Name  Age  Gender Department  Salary  \
0   1        Cory Escobar   48  Female         HR  5641.0
1   2     Timothy Sanchez   25   Other      Sales  4249.0
2   3        Chad Nichols   57   Other      Sales  3058.0
3   4  Christine Williams   58  Female         IT  5895.0
4   5        Amber Harris   35   Other         IT  4317.0

          Joining Date  Performance Score  Experience   Status  Location  \
0  2015-05-03 00:00:00           2.000000          16   Active    Remote
1  2020-11-09 00:00:00           2.000000          11  Retired    Remote
2  2019-02-12 00:00:00           3.441128           2  Retired  New York
3  2017-09-08 00:00:00           2.000000          13  Retired    Remote
4  2020-02-15 00:00:00           5.000000          16  Retired  New York

   Bonus  Salary_Normalized Experience Level    Age Group
0  564.1           0.454500           Senior  Middle-aged
1  424.9           0.280020           Senior        Young
2  305.8           0.130735           Junior       Senior
3  589.5           0.486337           Senior       Senior
4  431.7           0.288543           Senior  Middle-aged

In [62]:
# Question 25. Replace missing values in Performance Score with the median of the scores, grouped by Department.

groupby('Department'): Groups the data by the Department column.
transform(lambda x: x.fillna(x.median())): Computes the median of the Performance Score within each department and fills missing values with the computed median.
Updates the Performance Score column directly.

In [63]:
# Replace missing values in 'Performance Score' with the median of the scores grouped by 'Department'
df['Performance Score'] = df.groupby('Department')['Performance Score'].transform(
    lambda x: x.fillna(x.median())
)

# Display the updated DataFrame
print(df.head(50))

    ID                  Name  Age  Gender Department  Salary  \
0    1          Cory Escobar   48  Female         HR  5641.0
1    2       Timothy Sanchez   25   Other      Sales  4249.0
2    3          Chad Nichols   57   Other      Sales  3058.0
3    4    Christine Williams   58  Female         IT  5895.0
4    5          Amber Harris   35   Other         IT  4317.0
5    6           Ashley Howe   29  Female         HR  2591.0
6    7           David Olson   39  Female      Sales  6826.0
7    8          Amanda Baker   52   Other         HR  6285.0
9   10        Brian Faulkner   30    Male         IT  8202.0
10  11           Nicole Bell   42  Female      Sales  5336.0
11  12     Rodney Richardson   60   Other         HR  6908.0
13  14     Benjamin Callahan   34    Male         IT  5593.0
14  15    Matthew Collins MD   31  Female      Sales  8568.0
16  17        Jonathan Perez   59    Male         HR  6586.0
17  18    Jacqueline Randall   31  Female         HR  3519.0
18  19        Nancy Stephens   38    Male         HR  9061.0
19  20          Victoria Fox   57  Female         HR  7251.0
20  21         Heather Jones   35    Male      Sales  4565.0
22  23          Bryce Carter   35  Female      Sales  9598.0
23  24       Marissa Stewart   31  Female         HR  5386.0
24  25         Tracy Carlson   21    Male         HR  9275.0
25  26        Tara Blackwell   30   Other         HR  6120.0
26  27           Austin Long   20  Female         IT  4899.0
27  28         Jordan Warren   55  Female         HR  4608.0
29  30         Rachel Ramsey   22    Male      Sales  9661.0
30  31          Brandi Smith   21   Other         IT  4780.0
33  34      Mr. Brian Nelson   42  Female         IT  5207.0
34  35              Lisa Fry   51  Female         IT  9259.0
35  36           Kevin Watts   35    Male         IT  9078.0
36  37      Jacqueline Moore   39    Male      Sales  2364.0
37  38         Lawrence Rose   18  Female         HR  2904.0
38  39          Jordan Scott   33   Other      Sales  8678.0
39  40           Lisa Wagner   36    Male         HR  8870.0
40  41           Ricky Keith   20  Female      Sales  6621.0
41  42        Charles Mccall   58   Other         IT  9512.0
42  43           April Ponce   27  Female      Sales  6655.0
44  45        Daniel Aguirre   20   Other         IT  4184.0
45  46  Dr. Monica Hanna PhD   27   Other         HR  4356.0
46  47          Alicia Scott   47  Female         HR  7966.0
47  48          Jake Johnson   48   Other         IT  5848.0
48  49            Jamie Wood   46    Male      Sales  2773.0
49  50      Valerie Guerrero   23    Male         HR  6253.0
50  51         Jamie Gregory   27   Other      Sales  3253.0
52  53         Steve Salinas   42   Other      Sales  6567.0
55  56        Jonathon Adams   40  Female         IT  8745.0
56  57         Jeremy Conway   38   Other         IT  4954.0
57  58      Johnathan Obrien   58  Female      Sales  3635.0
58  59             Erik Moss   57    Male      Sales  4651.0
59  60         Melinda Tyler   19   Other      Sales  5937.0
60  61        Andrew Shannon   51   Other      Sales  8544.0

           Joining Date  Performance Score  Experience   Status     Location  \
0   2015-05-03 00:00:00           2.000000          16   Active       Remote
1   2020-11-09 00:00:00           2.000000          11  Retired       Remote
2   2019-02-12 00:00:00           3.441128           2  Retired     New York
3   2017-09-08 00:00:00           2.000000          13  Retired       Remote
4   2020-02-15 00:00:00           5.000000          16  Retired     New York
5   2016-06-24 00:00:00           1.000000           6   Active       Remote
6   2023-05-11 00:00:00           3.441128           4   Active     New York
7   2015-04-01 00:00:00           3.441128           8  Retired      Chicago
9   2018-05-26 00:00:00           1.000000           9   Active       Remote
10  2015-01-28 00:00:00           3.000000           7   Active  Los Angeles
11  2015-03-14 00:00:00           4.000000          19   Active      Chicago
13  2019-06-23 00:00:00           5.000000           2  Retired  Los Angeles
14  2020-06-01 00:00:00           3.441128          20  Retired  Los Angeles
16  2019-02-19 00:00:00           3.000000           7  Retired  Los Angeles
17  2018-05-18 00:00:00           4.000000           6   Active     New York
18  2017-07-16 00:00:00           5.000000          16  Retired      Chicago
19  2023-06-07 00:00:00           3.441128          10   Active  Los Angeles
20  2018-02-07 00:00:00           3.441128           9   Active      Chicago
22  2015-12-16 00:00:00           4.000000           4  Retired     New York
23  2021-01-30 00:00:00           3.441128           3   Active  Los Angeles
24  2022-04-09 00:00:00           4.000000          12   Active     New York
25  2020-02-20 00:00:00           5.000000           7   Active     New York
26  2024-05-01 00:00:00           5.000000           8  Retired      Chicago
27  2018-07-07 00:00:00           3.441128          18  Retired  Los Angeles
29  2016-08-18 00:00:00           2.000000          17  Retired       Remote
30  2020-01-20 00:00:00           1.000000           7  Retired       Remote
33  2017-08-17 00:00:00           1.000000           4   Active       Remote
34  2017-09-26 00:00:00           4.000000          17  Retired  Los Angeles
35  2019-06-12 00:00:00           1.000000           7  Retired       Remote
36  2018-02-25 00:00:00           1.000000          15   Active       Remote
37  2021-04-11 00:00:00           1.000000          17  Retired       Remote
38  2016-05-15 00:00:00           5.000000           9   Active  Los Angeles
39  2024-08-12 00:00:00           4.000000          17   Active  Los Angeles
40  2024-01-29 00:00:00           3.441128          20  Retired  Los Angeles
41  2024-11-10 00:00:00           5.000000           8  Retired  Los Angeles
42  2021-10-22 00:00:00           3.441128           2  Retired  Los Angeles
44  2017-10-03 00:00:00           5.000000          13   Active     New York
45  2020-10-31 00:00:00           3.441128          11  Retired     New York
46  2019-09-03 00:00:00           3.441128           8  Retired     New York
47  2017-02-03 00:00:00           3.000000           2   Active  Los Angeles
48  2023-02-25 00:00:00           4.000000           9   Active     New York
49  2023-09-21 00:00:00           4.000000          14   Active  Los Angeles
50  2015-12-07 00:00:00           3.441128          12   Active      Chicago
52  2022-03-26 00:00:00           2.000000          19  Retired       Remote
55  2020-07-29 00:00:00           5.000000          12  Retired      Chicago
56  2024-08-11 00:00:00           5.000000          12   Active  Los Angeles
57  2021-04-09 00:00:00           3.441128           7   Active     New York
58  2018-02-07 00:00:00           3.441128          19   Active  Los Angeles
59  2021-04-12 00:00:00           5.000000           9  Retired  Los Angeles
60  2020-02-08 00:00:00           3.441128           6   Active     New York

    Bonus  Salary_Normalized Experience Level    Age Group
0   564.1           0.454500           Senior  Middle-aged
1   424.9           0.280020           Senior        Young
2   305.8           0.130735           Junior       Senior
3   589.5           0.486337           Senior       Senior
4   431.7           0.288543           Senior  Middle-aged
5   259.1           0.072199              Mid        Young
6   682.6           0.603033           Junior  Middle-aged
7   628.5           0.535222              Mid       Senior
9   820.2           0.775508              Mid  Middle-aged
10  533.6           0.416270              Mid  Middle-aged
11  690.8           0.613312           Senior       Senior
13  559.3           0.448483           Junior  Middle-aged
14  856.8           0.821384           Senior  Middle-aged
16  658.6           0.572951              Mid       Senior
17  351.9           0.188518              Mid  Middle-aged
18  906.1           0.883179           Senior  Middle-aged
19  725.1           0.656305              Mid       Senior
20  456.5           0.319629              Mid  Middle-aged
22  959.8           0.950489           Junior  Middle-aged
23  538.6           0.422537           Junior  Middle-aged
24  927.5           0.910003           Senior        Young
25  612.0           0.514540              Mid  Middle-aged
26  489.9           0.361494              Mid        Young
27  460.8           0.325019           Senior       Senior
29  966.1           0.958386           Senior        Young
30  478.0           0.346578              Mid        Young
33  520.7           0.400100           Junior  Middle-aged
34  925.9           0.907997           Senior       Senior
35  907.8           0.885310              Mid  Middle-aged
36  236.4           0.043745           Senior  Middle-aged
37  290.4           0.111431           Senior        Young
38  867.8           0.835172              Mid  Middle-aged
39  887.0           0.859238           Senior  Middle-aged
40  662.1           0.577338           Senior        Young
41  951.2           0.939709              Mid       Senior
42  665.5           0.581599           Junior        Young
44  418.4           0.271873           Senior        Young
45  435.6           0.293432           Senior        Young
46  796.6           0.745926              Mid  Middle-aged
47  584.8           0.480446           Junior  Middle-aged
48  277.3           0.095011              Mid  Middle-aged
49  625.3           0.531211           Senior        Young
50  325.3           0.155177           Senior        Young
52  656.7           0.570569           Senior  Middle-aged
55  874.5           0.843570           Senior  Middle-aged
56  495.4           0.368388           Senior  Middle-aged
57  363.5           0.203058              Mid       Senior
58  465.1           0.330409           Senior       Senior
59  593.7           0.491602              Mid        Young
60  854.4           0.818376              Mid       Senior

In [64]:
# Check if there are any missing values left in 'Performance Score'
missing_values_count = df['Performance Score'].isna().sum()

if missing_values_count == 0:
    print("All missing values in 'Performance Score' have been replaced.")
else:
    print(f"There are still {missing_values_count} missing values in 'Performance Score'.")

All missing values in 'Performance Score' have been replaced.

In [65]:
# Question 26. Identify rows where the employee is in the "IT" department and their Age is above the average Age of "IT" employees

In [66]:
# Calculate the average Age of employees in the "IT" department
average_age_it = df[df['Department'] == 'IT']['Age'].mean()

# Identify rows where the employee is in "IT" and their Age is above the average Age
it_above_average_age = df[(df['Department'] == 'IT') & (df['Age'] > average_age_it)]

# Display the resulting rows
print(it_above_average_age)

       ID                Name  Age  Gender Department  Salary  \
3       4  Christine Williams   58  Female         IT  5895.0
33     34    Mr. Brian Nelson   42  Female         IT  5207.0
34     35            Lisa Fry   51  Female         IT  9259.0
41     42      Charles Mccall   58   Other         IT  9512.0
47     48        Jake Johnson   48   Other         IT  5848.0
..    ...                 ...  ...     ...        ...     ...
979   980    Crystal Espinoza   55  Female         IT  4952.0
984   985        Jeffrey Hall   41   Other         IT  8768.0
986   987     Melissa Bradley   39  Female         IT  9618.0
998   999       Ashley Taylor   51  Female         IT  5437.0
999  1000         Shawn Scott   45    Male         IT  7364.0

            Joining Date  Performance Score  Experience   Status     Location  \
3    2017-09-08 00:00:00                2.0          13  Retired       Remote
33   2017-08-17 00:00:00                1.0           4   Active       Remote
34   2017-09-26 00:00:00                4.0          17  Retired  Los Angeles
41   2024-11-10 00:00:00                5.0           8  Retired  Los Angeles
47   2017-02-03 00:00:00                3.0           2   Active  Los Angeles
..                   ...                ...         ...      ...          ...
979  2023-09-04 00:00:00                2.0           5   Active       Remote
984  2018-08-27 00:00:00                3.0          16  Retired  Los Angeles
986  2015-07-05 00:00:00                1.0          13   Active       Remote
998  2022-02-18 00:00:00                4.0           9  Retired  Los Angeles
999  2022-07-31 00:00:00                2.0           4   Active       Remote

     Bonus  Salary_Normalized Experience Level    Age Group
3    589.5           0.486337           Senior       Senior
33   520.7           0.400100           Junior  Middle-aged
34   925.9           0.907997           Senior       Senior
41   951.2           0.939709              Mid       Senior
47   584.8           0.480446           Junior  Middle-aged
..     ...                ...              ...          ...
979  495.2           0.368137           Junior       Senior
984  876.8           0.846453           Senior  Middle-aged
986  961.8           0.952996           Senior  Middle-aged
998  543.7           0.428930              Mid       Senior
999  736.4           0.670469           Junior  Middle-aged

[150 rows x 15 columns]

In [67]:
#Question 27. Identify rows with duplicate Name and Joining Date combinations, and remove duplicates.

duplicated(): Identifies rows with duplicate combinations of Name and Joining Date.
keep=False: Marks all duplicate rows.
drop_duplicates(): Removes duplicates, retaining the first occurrence.
The verification step ensures that no duplicates remain.

In [68]:
# Step 1: Identify duplicate rows based on Name and Joining Date
duplicates = df[df.duplicated(subset=['Name', 'Joining Date'], keep=False)]
print("Duplicate rows based on Name and Joining Date:")
print(duplicates)

# Step 2: Remove duplicates and keep the first occurrence
df = df.drop_duplicates(subset=['Name', 'Joining Date'], keep='first')

# Step 3: Verify no duplicates remain
remaining_duplicates = df[df.duplicated(subset=['Name', 'Joining Date'], keep=False)]
print("\nRemaining duplicates after removal:")
print(remaining_duplicates)

Duplicate rows based on Name and Joining Date:
Empty DataFrame
Columns: [ID, Name, Age, Gender, Department, Salary, Joining Date, Performance Score, Experience, Status, Location, Bonus, Salary_Normalized, Experience Level, Age Group]
Index: []

Remaining duplicates after removal:
Empty DataFrame
Columns: [ID, Name, Age, Gender, Department, Salary, Joining Date, Performance Score, Experience, Status, Location, Bonus, Salary_Normalized, Experience Level, Age Group]
Index: []

In [69]:
#Question 28. Remove rows where the Experience value is inconsistent with the Age (e.g., Experience > Age - 18).

Identify inconsistent rows: Use a condition to filter rows where Experience > Age - 18.
Remove inconsistent rows: Retain only rows where Experience <= Age - 18.
Verification: Ensure no inconsistent rows remain after removal.

In [70]:
# Step 1: Identify rows where Experience is inconsistent with Age
inconsistent_rows = df[df['Experience'] > (df['Age'] - 18)]
print("Inconsistent rows (Experience > Age - 18):")
print(inconsistent_rows)

# Step 2: Remove inconsistent rows
df = df[df['Experience'] <= (df['Age'] - 18)]

# Step 3: Verify that inconsistent rows are removed
remaining_inconsistent = df[df['Experience'] > (df['Age'] - 18)]
print("\nRemaining inconsistent rows after removal:")
print(remaining_inconsistent)

Inconsistent rows (Experience > Age - 18):
      ID                Name  Age  Gender Department  Salary  \
1      2     Timothy Sanchez   25   Other      Sales  4249.0
14    15  Matthew Collins MD   31  Female      Sales  8568.0
24    25       Tracy Carlson   21    Male         HR  9275.0
26    27         Austin Long   20  Female         IT  4899.0
29    30       Rachel Ramsey   22    Male      Sales  9661.0
..   ...                 ...  ...     ...        ...     ...
991  992     William Schultz   23   Other      Sales  4311.0
992  993      Ashley Daniels   25   Other      Sales  5524.0
994  995     Rachel Phillips   22    Male         IT  3096.0
996  997        Todd Johnson   29  Female      Sales  6754.0
997  998     Michael Sanchez   18    Male      Sales  5278.0

            Joining Date  Performance Score  Experience   Status     Location  \
1    2020-11-09 00:00:00           2.000000          11  Retired       Remote
14   2020-06-01 00:00:00           3.441128          20  Retired  Los Angeles
24   2022-04-09 00:00:00           4.000000          12   Active     New York
26   2024-05-01 00:00:00           5.000000           8  Retired      Chicago
29   2016-08-18 00:00:00           2.000000          17  Retired       Remote
..                   ...                ...         ...      ...          ...
991  2019-08-17 00:00:00           3.441128          10  Retired  Los Angeles
992  2022-11-24 00:00:00           3.441128           8  Retired     New York
994  2018-10-27 00:00:00           2.000000           7  Retired       Remote
996  2018-07-20 00:00:00           3.441128          12  Retired     New York
997  2023-07-05 00:00:00           5.000000           3   Active     New York

     Bonus  Salary_Normalized Experience Level    Age Group
1    424.9           0.280020           Senior        Young
14   856.8           0.821384           Senior  Middle-aged
24   927.5           0.910003           Senior        Young
26   489.9           0.361494              Mid        Young
29   966.1           0.958386           Senior        Young
..     ...                ...              ...          ...
991  431.1           0.287791              Mid        Young
992  552.4           0.439835              Mid        Young
994  309.6           0.135498              Mid        Young
996  675.4           0.594009           Senior        Young
997  527.8           0.409000           Junior        Young

[234 rows x 15 columns]

Remaining inconsistent rows after removal:
Empty DataFrame
Columns: [ID, Name, Age, Gender, Department, Salary, Joining Date, Performance Score, Experience, Status, Location, Bonus, Salary_Normalized, Experience Level, Age Group]
Index: []

In [71]:
#Question 29. Sort the DataFrame by Salary in descending order.

sort_values(by='Salary'): Sorts the DataFrame by the Salary column.
ascending=False: Ensures the sorting is in descending order.
df_sorted: Contains the sorted DataFrame, leaving the original DataFrame unchanged.

In [72]:
# Sort the DataFrame by Salary in descending order
df_sorted = df.sort_values(by='Salary', ascending=False)

# Display the sorted DataFrame
print(df_sorted)

      ID                Name  Age  Gender Department  Salary  \
811  812        Jesse Miller   52    Male         HR  9993.0
531  532  Jeffrey Williamson   54   Other         IT  9988.0
937  938       Gary Mitchell   52  Female      Sales  9963.0
908  909       Sara Martinez   34   Other         HR  9951.0
120  121       David Hampton   39  Female         HR  9941.0
..   ...                 ...  ...     ...        ...     ...
426  427      Patricia Scott   52    Male         HR  2041.0
882  883      Jaclyn Collins   47    Male         IT  2029.0
76    77       Victor Nelson   47  Female      Sales  2025.0
473  474        David Potter   56    Male         IT  2016.0
906  907   Christina Carlson   42  Female      Sales  2015.0

            Joining Date  Performance Score  Experience   Status     Location  \
811  2020-11-27 00:00:00           3.441128          12   Active      Chicago
531  2015-12-08 00:00:00           5.000000          16  Retired      Chicago
937  2016-09-22 00:00:00           5.000000          20  Retired  Los Angeles
908  2024-02-18 00:00:00           3.441128           6  Retired     New York
120  2024-07-06 00:00:00           3.000000          15  Retired     New York
..                   ...                ...         ...      ...          ...
426  2022-11-22 00:00:00           1.000000           8  Retired       Remote
882  2019-12-05 00:00:00           5.000000          17   Active  Los Angeles
76   2015-05-14 00:00:00           1.000000           5   Active       Remote
473  2020-07-13 00:00:00           5.000000          18   Active     New York
906  2020-05-08 00:00:00           1.000000          14  Retired       Remote

     Bonus  Salary_Normalized Experience Level    Age Group
811  999.3           1.000000           Senior       Senior
531  998.8           0.999373           Senior       Senior
937  996.3           0.996240           Senior       Senior
908  995.1           0.994736              Mid  Middle-aged
120  994.1           0.993482           Senior  Middle-aged
..     ...                ...              ...          ...
426  204.1           0.003259              Mid       Senior
882  202.9           0.001755           Senior  Middle-aged
76   202.5           0.001253           Junior  Middle-aged
473  201.6           0.000125           Senior       Senior
906  201.5           0.000000           Senior  Middle-aged

[660 rows x 15 columns]

In [73]:
#Question 30. Sort the DataFrame by Department and then by Joining Date in ascending order.

sort_values(by=['Department', 'Joining Date']): Specifies the columns for sorting.
ascending=[True, True]: Ensures both columns are sorted in ascending order.
df_sorted: Contains the sorted DataFrame, leaving the original DataFrame unchanged.

In [74]:
# Sort the DataFrame by Department and Joining Date in ascending order
df_sorted = df.sort_values(by=['Department', 'Joining Date'], ascending=[True, True])

# Display the sorted DataFrame
print(df_sorted)

      ID               Name  Age  Gender Department  Salary  \
514  515  Taylor Williamson   48    Male         HR  9293.0
11    12  Rodney Richardson   60   Other         HR  6908.0
7      8       Amanda Baker   52   Other         HR  6285.0
677  678    Michelle Durham   35    Male         HR  5900.0
0      1       Cory Escobar   48  Female         HR  5641.0
..   ...                ...  ...     ...        ...     ...
405  406      Heather Scott   57    Male      Sales  9505.0
864  865     Jessica Garcia   47    Male      Sales  8619.0
819  820         Amber Ward   54  Female      Sales  7880.0
141  142  Matthew Gutierrez   38   Other      Sales  5883.0
169  170      George Bowers   24   Other      Sales  6041.0

            Joining Date  Performance Score  Experience   Status  Location  \
514  2015-03-10 00:00:00           3.441128          17  Retired   Chicago
11   2015-03-14 00:00:00           4.000000          19   Active   Chicago
7    2015-04-01 00:00:00           3.441128           8  Retired   Chicago
677  2015-04-25 00:00:00           3.441128          12   Active   Chicago
0    2015-05-03 00:00:00           2.000000          16   Active    Remote
..                   ...                ...         ...      ...       ...
405  2024-08-18 00:00:00           3.000000           6  Retired  New York
864  2024-08-23 00:00:00           2.000000          13   Active    Remote
819  2024-09-19 00:00:00           3.000000           6   Active  New York
141  2024-10-22 00:00:00           4.000000          14  Retired   Chicago
169  2024-12-07 00:00:00           2.000000           4   Active    Remote

     Bonus  Salary_Normalized Experience Level    Age Group
514  929.3           0.912259           Senior  Middle-aged
11   690.8           0.613312           Senior       Senior
7    628.5           0.535222              Mid       Senior
677  590.0           0.486964           Senior  Middle-aged
0    564.1           0.454500           Senior  Middle-aged
..     ...                ...              ...          ...
405  950.5           0.938832              Mid       Senior
864  861.9           0.827776           Senior  Middle-aged
819  788.0           0.735147              Mid       Senior
141  588.3           0.484833           Senior  Middle-aged
169  604.1           0.504638           Junior        Young

[660 rows x 15 columns]

In [75]:
#Question 31. Rank all employees by Salary within their Department and add the rank as a new column.

groupby('Department'): Groups the data by Department.
rank():
ascending=False: Ranks in descending order (highest salary gets rank 1).
method='dense': Ensures there are no gaps in ranking.
Salary Rank: New column added to store the rank.

In [76]:
# Rank employees by Salary within their Department
df['Salary Rank'] = df.groupby('Department')['Salary'].rank(ascending=False, method='dense')

# Display the DataFrame with the new column
print(df[['Name', 'Department', 'Salary', 'Salary Rank']])

                    Name Department  Salary  Salary Rank
0           Cory Escobar         HR  5641.0        113.0
2           Chad Nichols      Sales  3058.0        191.0
3     Christine Williams         IT  5895.0        108.0
4           Amber Harris         IT  4317.0        157.0
5            Ashley Howe         HR  2591.0        193.0
...                  ...        ...     ...          ...
993        Brandon Bruce         HR  3371.0        169.0
995        Pamela Reeves      Sales  7652.0         65.0
998        Ashley Taylor         IT  5437.0        124.0
999          Shawn Scott         IT  7364.0         78.0
1000            John Doe         HR  5000.0        128.0

[660 rows x 4 columns]

In [77]:
# Verify the Salary Rank by displaying Department, Name, Salary, and Salary Rank
verification = df[['Department', 'Name', 'Salary', 'Salary Rank']].sort_values(by=['Department', 'Salary'], ascending=[True, False])

# Display the verification DataFrame
print(verification)

    Department               Name  Salary  Salary Rank
811         HR       Jesse Miller  9993.0          1.0
908         HR      Sara Martinez  9951.0          2.0
120         HR      David Hampton  9941.0          3.0
200         HR  Mr. James Johnson  9930.0          4.0
580         HR   Jennifer Stewart  9772.0          5.0
..         ...                ...     ...          ...
698      Sales      Ashley Garcia  2106.0        219.0
841      Sales        Tammy Smith  2087.0        220.0
787      Sales     David Williams  2078.0        221.0
76       Sales      Victor Nelson  2025.0        222.0
906      Sales  Christina Carlson  2015.0        223.0

[660 rows x 4 columns]

Here’s the code to verify the Salary Rank column after ranking employees by salary within their department:

In [78]:
# Verify the Salary Rank by displaying Department, Name, Salary, and Salary Rank
verification = df[['Department', 'Name', 'Salary', 'Salary Rank']].sort_values(by=['Department', 'Salary'], ascending=[True, False])

# Display the verification DataFrame
print(verification)

    Department               Name  Salary  Salary Rank
811         HR       Jesse Miller  9993.0          1.0
908         HR      Sara Martinez  9951.0          2.0
120         HR      David Hampton  9941.0          3.0
200         HR  Mr. James Johnson  9930.0          4.0
580         HR   Jennifer Stewart  9772.0          5.0
..         ...                ...     ...          ...
698      Sales      Ashley Garcia  2106.0        219.0
841      Sales        Tammy Smith  2087.0        220.0
787      Sales     David Williams  2078.0        221.0
76       Sales      Victor Nelson  2025.0        222.0
906      Sales  Christina Carlson  2015.0        223.0

[660 rows x 4 columns]

In [79]:
#Question 32. Sort the dataset by Experience in descending order, but break ties using Performance Score in ascending order.

by=['Experience', 'Performance Score']: Sort first by Experience in descending order (highest to lowest), and for rows with equal Experience, break the tie by sorting by Performance Score in ascending order (lowest to highest).
ascending=[False, True]: False for descending order for Experience, and True for ascending order for Performance Score.

In [80]:
# Sort the dataset by Experience (descending) and then by Performance Score (ascending)
df_sorted = df.sort_values(by=['Experience', 'Performance Score'], ascending=[False, True])

# Display the sorted DataFrame
print(df_sorted)

      ID            Name  Age  Gender Department  Salary         Joining Date  \
355  356  Laura Castillo   41    Male         IT  2392.0  2024-03-15 00:00:00
402  403   Briana Martin   59    Male      Sales  4496.0  2023-05-22 00:00:00
538  539  Brandon Church   38    Male         HR  8388.0  2021-08-02 00:00:00
828  829  Michael Snyder   55   Other      Sales  7497.0  2024-02-03 00:00:00
529  530      Katie Vega   40  Female         HR  7002.0  2019-08-06 00:00:00
..   ...             ...  ...     ...        ...     ...                  ...
732  733       Jay Evans   21    Male         HR  8147.0  2022-03-29 00:00:00
797  798   Melanie Casey   44   Other         HR  4713.0  2017-10-09 00:00:00
803  804   Jacob Aguilar   23    Male         IT  2372.0  2020-06-01 00:00:00
879  880    Sarah Thomas   54    Male         IT  6185.0  2016-10-29 00:00:00
987  988  Danielle Brown   31  Female         IT  5605.0  2024-06-28 00:00:00

     Performance Score  Experience   Status  Location  Bonus  \
355                1.0          20  Retired    Remote  239.2
402                1.0          20  Retired    Remote  449.6
538                1.0          20  Retired    Remote  838.8
828                1.0          20  Retired    Remote  749.7
529                2.0          20   Active    Remote  700.2
..                 ...         ...      ...       ...    ...
732                5.0           2  Retired   Chicago  814.7
797                5.0           2   Active  New York  471.3
803                5.0           2  Retired   Chicago  237.2
879                5.0           2   Active  New York  618.5
987                5.0           2   Active   Chicago  560.5

     Salary_Normalized Experience Level    Age Group  Salary Rank
355           0.047255           Senior  Middle-aged        209.0
402           0.310980           Senior       Senior        147.0
538           0.798822           Senior  Middle-aged         33.0
828           0.687140           Senior       Senior         73.0
529           0.625094           Senior  Middle-aged         76.0
..                 ...              ...          ...          ...
732           0.768614           Junior        Young         47.0
797           0.338180           Junior  Middle-aged        134.0
803           0.044748           Junior        Young        211.0
879           0.522687           Junior       Senior         99.0
987           0.449987           Junior  Middle-aged        115.0

[660 rows x 16 columns]

In [81]:
#Question 33 Create a new DataFrame containing only employees in "HR" with a Salary above 5000.

df['Department'] == 'HR': Filters the rows where the Department column is "HR".
df['Salary'] > 5000: Filters the rows where the Salary is greater than 5000.
The & operator is used to combine both conditions, and the result is a new DataFrame, hr_above_5000.
This will display only the employees from the "HR" department with a salary above 5000.

In [82]:
# Filter the DataFrame for employees in HR department with Salary above 5000
hr_above_5000 = df[(df['Department'] == 'HR') & (df['Salary'] > 5000)]

# Display the new DataFrame
print(hr_above_5000)

      ID                 Name  Age  Gender Department  Salary  \
0      1         Cory Escobar   48  Female         HR  5641.0
7      8         Amanda Baker   52   Other         HR  6285.0
11    12    Rodney Richardson   60   Other         HR  6908.0
16    17       Jonathan Perez   59    Male         HR  6586.0
18    19       Nancy Stephens   38    Male         HR  9061.0
..   ...                  ...  ...     ...        ...     ...
941  942  Elizabeth Middleton   38   Other         HR  8277.0
944  945       Mary Armstrong   29  Female         HR  9402.0
953  954         Ruth Osborne   53    Male         HR  5616.0
958  959       Morgan Coleman   51  Female         HR  6415.0
983  984          David Moody   43    Male         HR  8830.0

            Joining Date  Performance Score  Experience   Status     Location  \
0    2015-05-03 00:00:00           2.000000          16   Active       Remote
7    2015-04-01 00:00:00           3.441128           8  Retired      Chicago
11   2015-03-14 00:00:00           4.000000          19   Active      Chicago
16   2019-02-19 00:00:00           3.000000           7  Retired  Los Angeles
18   2017-07-16 00:00:00           5.000000          16  Retired      Chicago
..                   ...                ...         ...      ...          ...
941  2020-09-05 00:00:00           4.000000           9  Retired  Los Angeles
944  2017-12-13 00:00:00           3.441128           2   Active     New York
953  2022-07-31 00:00:00           4.000000          16   Active  Los Angeles
958  2022-03-20 00:00:00           1.000000           8  Retired       Remote
983  2021-09-10 00:00:00           3.441128          19  Retired      Chicago

     Bonus  Salary_Normalized Experience Level    Age Group  Salary Rank
0    564.1           0.454500           Senior  Middle-aged        113.0
7    628.5           0.535222              Mid       Senior        102.0
11   690.8           0.613312           Senior       Senior         80.0
16   658.6           0.572951              Mid       Senior         92.0
18   906.1           0.883179           Senior  Middle-aged         19.0
..     ...                ...              ...          ...          ...
941  827.7           0.784908              Mid  Middle-aged         38.0
944  940.2           0.925921           Junior        Young         11.0
953  561.6           0.451366           Senior       Senior        114.0
958  641.5           0.551517              Mid       Senior         98.0
983  883.0           0.854224           Senior  Middle-aged         24.0

[128 rows x 16 columns]

To verify if the code works correctly, you can check the first few rows or other relevant details of the filtered DataFrame. Here's how you can verify it:

In [83]:
# Verify the new DataFrame
print(hr_above_5000.head())  # Display the first 5 rows
print(hr_above_5000.shape)   # Print the number of rows and columns
print(hr_above_5000['Department'].unique())  # Check the unique departments (should only be 'HR')
print(hr_above_5000['Salary'].max())  # Check the highest salary to verify the salary filter

    ID               Name  Age  Gender Department  Salary  \
0    1       Cory Escobar   48  Female         HR  5641.0
7    8       Amanda Baker   52   Other         HR  6285.0
11  12  Rodney Richardson   60   Other         HR  6908.0
16  17     Jonathan Perez   59    Male         HR  6586.0
18  19     Nancy Stephens   38    Male         HR  9061.0

           Joining Date  Performance Score  Experience   Status     Location  \
0   2015-05-03 00:00:00           2.000000          16   Active       Remote
7   2015-04-01 00:00:00           3.441128           8  Retired      Chicago
11  2015-03-14 00:00:00           4.000000          19   Active      Chicago
16  2019-02-19 00:00:00           3.000000           7  Retired  Los Angeles
18  2017-07-16 00:00:00           5.000000          16  Retired      Chicago

    Bonus  Salary_Normalized Experience Level    Age Group  Salary Rank
0   564.1           0.454500           Senior  Middle-aged        113.0
7   628.5           0.535222              Mid       Senior        102.0
11  690.8           0.613312           Senior       Senior         80.0
16  658.6           0.572951              Mid       Senior         92.0
18  906.1           0.883179           Senior  Middle-aged         19.0
(128, 16)
['HR']
9993.0

In [84]:
#Question 34. Filter out all rows where the Location is "Chicago".

Filter out all rows where the Location column has the value "Chicago."
Print the first few rows of the filtered DataFrame to confirm.
Display the unique values in the Location column to ensure "Chicago" has been removed.

In [85]:
# Filter out rows where Location is "Chicago"
df_filtered = df[df['Location'] != 'Chicago']

# Verify the change by checking the first few rows and the unique locations
print(df_filtered.head())  # Display the first 5 rows
print(df_filtered['Location'].unique())  # Check the unique locations in the filtered dataset

   ID                Name  Age  Gender Department  Salary  \
0   1        Cory Escobar   48  Female         HR  5641.0
2   3        Chad Nichols   57   Other      Sales  3058.0
3   4  Christine Williams   58  Female         IT  5895.0
4   5        Amber Harris   35   Other         IT  4317.0
5   6         Ashley Howe   29  Female         HR  2591.0

          Joining Date  Performance Score  Experience   Status  Location  \
0  2015-05-03 00:00:00           2.000000          16   Active    Remote
2  2019-02-12 00:00:00           3.441128           2  Retired  New York
3  2017-09-08 00:00:00           2.000000          13  Retired    Remote
4  2020-02-15 00:00:00           5.000000          16  Retired  New York
5  2016-06-24 00:00:00           1.000000           6   Active    Remote

   Bonus  Salary_Normalized Experience Level    Age Group  Salary Rank
0  564.1           0.454500           Senior  Middle-aged        113.0
2  305.8           0.130735           Junior       Senior        191.0
3  589.5           0.486337           Senior       Senior        108.0
4  431.7           0.288543           Senior  Middle-aged        157.0
5  259.1           0.072199              Mid        Young        193.0
['Remote' 'New York' 'Los Angeles']

In [86]:
#Question 35. Delete all rows where the Performance Score is below 2.

Filters the rows where the Performance Score is greater than or equal to 2.
Displays the first few rows of the cleaned DataFrame to verify the change.

In [87]:
# Delete rows where Performance Score is below 2
df_cleaned = df[df['Performance Score'] >= 2]

# Verify the result by checking the first few rows
print(df_cleaned.head())

   ID                Name  Age  Gender Department  Salary  \
0   1        Cory Escobar   48  Female         HR  5641.0
2   3        Chad Nichols   57   Other      Sales  3058.0
3   4  Christine Williams   58  Female         IT  5895.0
4   5        Amber Harris   35   Other         IT  4317.0
6   7         David Olson   39  Female      Sales  6826.0

          Joining Date  Performance Score  Experience   Status  Location  \
0  2015-05-03 00:00:00           2.000000          16   Active    Remote
2  2019-02-12 00:00:00           3.441128           2  Retired  New York
3  2017-09-08 00:00:00           2.000000          13  Retired    Remote
4  2020-02-15 00:00:00           5.000000          16  Retired  New York
6  2023-05-11 00:00:00           3.441128           4   Active  New York

   Bonus  Salary_Normalized Experience Level    Age Group  Salary Rank
0  564.1           0.454500           Senior  Middle-aged        113.0
2  305.8           0.130735           Junior       Senior        191.0
3  589.5           0.486337           Senior       Senior        108.0
4  431.7           0.288543           Senior  Middle-aged        157.0
6  682.6           0.603033           Junior  Middle-aged         90.0

In [88]:
#Question 36. Find the average Salary for each Department.

In [89]:
# Group by 'Department' and calculate the average Salary for each department
average_salary_per_department = df.groupby('Department')['Salary'].mean()

# Display the result
print(average_salary_per_department)

Department
HR       5943.927885
IT       5935.701754
Sales    5888.125000
Name: Salary, dtype: float64

In [90]:
#Question 37. Calculate the total Salary of all employees grouped by Status.

To calculate the total salary of all employees grouped by their Status, you can use the groupby() method and then apply the sum() function to the Salary column. Here's the code:

In [91]:
# Group by 'Status' and calculate the total Salary for each Status
total_salary_per_status = df.groupby('Status')['Salary'].sum()

# Display the result
print(total_salary_per_status)

Status
Active     1903828.0
Retired    2004789.0
Name: Salary, dtype: float64

In [92]:
#Question 38. Find the maximum Performance Score for employees in each Location.

To find the maximum Performance Score for employees in each Location, you can group the data by the Location column and then use the max() function on the Performance Score column. Here's the code:

In [93]:
# Group by 'Location' and calculate the maximum Performance Score for each Location
max_performance_per_location = df.groupby('Location')['Performance Score'].max()

# Display the result
print(max_performance_per_location)

Location
Chicago        5.0
Los Angeles    5.0
New York       5.0
Remote         3.0
Name: Performance Score, dtype: float64

In [94]:
#Question 39. Calculate the total Salary paid to employees who joined in each year.

To calculate the total Salary paid to employees who joined in each year, you can extract the year from the Joining Date column, group the data by the year, and then sum the Salary column. Here's the code to do that:

In [95]:
# Convert 'Joining Date' to datetime format (if not already)
df['Joining Date'] = pd.to_datetime(df['Joining Date'])

# Extract the year from 'Joining Date'
df['Joining Year'] = df['Joining Date'].dt.year

# Group by 'Joining Year' and calculate the total Salary for each year
total_salary_per_year = df.groupby('Joining Year')['Salary'].sum()

# Display the result
print(total_salary_per_year)

Joining Year
2014     15135.0
2015    311765.0
2016    392334.0
2017    363912.0
2018    411163.0
2019    356791.0
2020    384911.0
2021    460362.0
2022    362818.0
2023    476092.0
2024    373334.0
Name: Salary, dtype: float64

In [96]:
#Question 40. Find the department with the highest average Performance Score.

To find the department with the highest average Performance Score, you can group the data by the Department column, calculate the mean of the Performance Score for each department, and then find the department with the highest value. Here's the code to do that:

In [97]:
# Group by 'Department' and calculate the average Performance Score for each department
avg_performance_per_dept = df.groupby('Department')['Performance Score'].mean()

# Find the department with the highest average Performance Score
highest_avg_performance_dept = avg_performance_per_dept.idxmax()

# Display the result
print(f"The department with the highest average Performance Score is: {highest_avg_performance_dept}")

The department with the highest average Performance Score is: IT

In [98]:
#Question 41. Count the number of employees in each Location grouped by their Session.

You can count the number of employees in each Location, grouped by their Session using the groupby() method followed by size() to get the count. Here’s the code:

In [99]:
# Drop the 'Session' column if it exists, ignore error if it doesn't
df = df.drop('Session', axis=1, errors='ignore')

# Verify the changes
print(df.head())

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR  5641.0   2015-05-03
2   3        Chad Nichols   57   Other      Sales  3058.0   2019-02-12
3   4  Christine Williams   58  Female         IT  5895.0   2017-09-08
4   5        Amber Harris   35   Other         IT  4317.0   2020-02-15
5   6         Ashley Howe   29  Female         HR  2591.0   2016-06-24

   Performance Score  Experience   Status  Location  Bonus  Salary_Normalized  \
0           2.000000          16   Active    Remote  564.1           0.454500
2           3.441128           2  Retired  New York  305.8           0.130735
3           2.000000          13  Retired    Remote  589.5           0.486337
4           5.000000          16  Retired  New York  431.7           0.288543
5           1.000000           6   Active    Remote  259.1           0.072199

  Experience Level    Age Group  Salary Rank  Joining Year
0           Senior  Middle-aged        113.0          2015
2           Junior       Senior        191.0          2019
3           Senior       Senior        108.0          2017
4           Senior  Middle-aged        157.0          2020
5              Mid        Young        193.0          2016

In [100]:
#Queston 42. Group employees by Status and calculate the sum, mean, and standard deviation of their Salary.

We can group employees by their Status and calculate the sum, mean, and standard deviation of their Salary using the groupby() method along with agg(). Here’s the code:

This code will provide the total (sum), average (mean), and standard deviation (std) of the Salary for each Status.

In [101]:
# Group by Status and calculate sum, mean, and standard deviation of Salary
salary_stats_by_status = df.groupby('Status')['Salary'].agg(['sum', 'mean', 'std'])

# Display the result
print(salary_stats_by_status)

               sum         mean          std
Status
Active   1903828.0  5857.932308  2345.912949
Retired  2004789.0  5984.444776  2331.021589

In [102]:
#Question 43. Use the apply() method to create a new column Monthly Salary by dividing the Salary by 12.


We can use the apply() method to create a new column Monthly Salary by dividing the Salary by 12. Here's the code to do that:

In [103]:
# Create a new column 'Monthly Salary' by applying the division of Salary by 12
df['Monthly Salary'] = df['Salary'].apply(lambda x: x / 12)

# Display the first few rows to verify
print(df[['Name', 'Salary', 'Monthly Salary']].head())

                 Name  Salary  Monthly Salary
0        Cory Escobar  5641.0      470.083333
2        Chad Nichols  3058.0      254.833333
3  Christine Williams  5895.0      491.250000
4        Amber Harris  4317.0      359.750000
5         Ashley Howe  2591.0      215.916667

In [104]:
#Question 44. Use the applymap() method to convert all string values in the DataFrame to uppercase.

To use the applymap() method to convert all string values in the DataFrame to uppercase, you can apply a function to each element of the DataFrame. Here's the code:

In [105]:
# Use applymap to convert all string values in the DataFrame to uppercase
df = df.applymap(lambda x: x.upper() if isinstance(x, str) else x)

# Display the first few rows to verify
print(df.head())

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        CORY ESCOBAR   48  FEMALE         HR  5641.0   2015-05-03
2   3        CHAD NICHOLS   57   OTHER      SALES  3058.0   2019-02-12
3   4  CHRISTINE WILLIAMS   58  FEMALE         IT  5895.0   2017-09-08
4   5        AMBER HARRIS   35   OTHER         IT  4317.0   2020-02-15
5   6         ASHLEY HOWE   29  FEMALE         HR  2591.0   2016-06-24

   Performance Score  Experience   Status  Location  Bonus  Salary_Normalized  \
0           2.000000          16   ACTIVE    REMOTE  564.1           0.454500
2           3.441128           2  RETIRED  NEW YORK  305.8           0.130735
3           2.000000          13  RETIRED    REMOTE  589.5           0.486337
4           5.000000          16  RETIRED  NEW YORK  431.7           0.288543
5           1.000000           6   ACTIVE    REMOTE  259.1           0.072199

  Experience Level    Age Group  Salary Rank  Joining Year  Monthly Salary
0           SENIOR  MIDDLE-AGED        113.0          2015      470.083333
2           JUNIOR       SENIOR        191.0          2019      254.833333
3           SENIOR       SENIOR        108.0          2017      491.250000
4           SENIOR  MIDDLE-AGED        157.0          2020      359.750000
5              MID        YOUNG        193.0          2016      215.916667

C:\Users\charl\AppData\Local\Temp\ipykernel_19264\2947478034.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(lambda x: x.upper() if isinstance(x, str) else x)

In [106]:
#Question 45. Create a second dataset containing Department and Budget. Perform an inner join with the original dataset.


To perform an inner join between your original dataset and a second dataset containing Department and Budget, follow these steps:

Create a second dataset with the Department and Budget columns.
Use the merge() function to perform the inner join on the Department column.

In [107]:
import pandas as pd

# Original dataset (assuming 'df' is your original dataset)
# Sample second dataset with 'Department' and 'Budget'
data2 = {
    'Department': ['HR', 'Sales', 'IT', 'Marketing', 'Finance'],
    'Budget': [50000, 80000, 120000, 70000, 90000]
}
df2 = pd.DataFrame(data2)

# Perform an inner join on 'Department'
df_merged = pd.merge(df, df2, on='Department', how='inner')

# Display the first few rows of the merged dataset
print(df_merged.head())

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        CORY ESCOBAR   48  FEMALE         HR  5641.0   2015-05-03
1   4  CHRISTINE WILLIAMS   58  FEMALE         IT  5895.0   2017-09-08
2   5        AMBER HARRIS   35   OTHER         IT  4317.0   2020-02-15
3   6         ASHLEY HOWE   29  FEMALE         HR  2591.0   2016-06-24
4   8        AMANDA BAKER   52   OTHER         HR  6285.0   2015-04-01

   Performance Score  Experience   Status  Location  Bonus  Salary_Normalized  \
0           2.000000          16   ACTIVE    REMOTE  564.1           0.454500
1           2.000000          13  RETIRED    REMOTE  589.5           0.486337
2           5.000000          16  RETIRED  NEW YORK  431.7           0.288543
3           1.000000           6   ACTIVE    REMOTE  259.1           0.072199
4           3.441128           8  RETIRED   CHICAGO  628.5           0.535222

  Experience Level    Age Group  Salary Rank  Joining Year  Monthly Salary  \
0           SENIOR  MIDDLE-AGED        113.0          2015      470.083333
1           SENIOR       SENIOR        108.0          2017      491.250000
2           SENIOR  MIDDLE-AGED        157.0          2020      359.750000
3              MID        YOUNG        193.0          2016      215.916667
4              MID       SENIOR        102.0          2015      523.750000

   Budget
0   50000
1  120000
2  120000
3   50000
4   50000

In [108]:
#Question 46. Merge the dataset with another dataset that includes additional information about employee ID and their recent Projects.

df is your original dataset.
df2 is the second dataset containing Employee ID and Recent Projects.
The merge() function is used to merge the datasets on the Employee ID column. In your dataset, Employee ID corresponds to the ID column in the original dataset.
how='left' ensures all rows from the original dataset (df) are kept, and the Recent Projects information from df2 is added where Employee ID matches. If no match is found, it will add NaN in the Recent Projects column for that row.

In [109]:
import pandas as pd

# Original dataset
data1 = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Department': ['HR', 'IT', 'Sales', 'HR', 'IT'],
    'Salary': [5000, 6000, 7000, 8000, 9000]
}
df1 = pd.DataFrame(data1)

# Second dataset with recent projects
data2 = {
    'ID': [1, 2, 4, 5],
    'Recent Projects': ['Project A', 'Project B', 'Project D', 'Project E']
}
df2 = pd.DataFrame(data2)

# Merge the datasets on 'ID'
merged_df = pd.merge(df1, df2, on='ID', how='left')

# Display the merged dataset
print(merged_df)

   ID     Name Department  Salary Recent Projects
0   1    Alice         HR    5000       Project A
1   2      Bob         IT    6000       Project B
2   3  Charlie      Sales    7000             NaN
3   4    David         HR    8000       Project D
4   5      Eve         IT    9000       Project E

In [110]:
#Question 47. Perform a left join with a dataset containing Department and Team Lead details, adding Team Lead to the DataFrame.

df1: Original dataset containing employee details.
df2: Dataset with Department and Team Lead information.
pd.merge(): Merges the two datasets on the Department column.
how='left': Ensures all rows from the original dataset are included, with missing team lead information filled with NaN.

In [111]:
import pandas as pd

# Original dataset
data1 = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Department': ['HR', 'IT', 'Sales', 'HR', 'IT'],
    'Salary': [5000, 6000, 7000, 8000, 9000]
}
df1 = pd.DataFrame(data1)

# Dataset with Department and Team Lead details
data2 = {
    'Department': ['HR', 'IT', 'Sales', 'Marketing'],
    'Team Lead': ['Karen', 'Mike', 'Susan', 'John']
}
df2 = pd.DataFrame(data2)

# Perform the left join on the 'Department' column
merged_df = pd.merge(df1, df2, on='Department', how='left')

# Display the merged DataFrame
print(merged_df)

   ID     Name Department  Salary Team Lead
0   1    Alice         HR    5000     Karen
1   2      Bob         IT    6000      Mike
2   3  Charlie      Sales    7000     Susan
3   4    David         HR    8000     Karen
4   5      Eve         IT    9000      Mike

In [112]:
#Question 48. Create a DataFrame with employee ID and Project Count, then merge it with the original dataset.Calculate the average Salary per project.

Create the original dataset (df1) with employee details including ID, Name, Department, and Salary.
Create another dataset (df2) with employee ID and Project Count.
Perform a left join on ID using pd.merge().
Add a new column Salary per Project by dividing the Salary by the Project Count.
Calculate the overall average Salary per project using the .mean() method.

In [113]:
import pandas as pd

# Original dataset
data1 = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Department': ['HR', 'IT', 'Sales', 'HR', 'IT'],
    'Salary': [5000, 6000, 7000, 8000, 9000]
}
df1 = pd.DataFrame(data1)

# Dataset with employee ID and Project Count
data2 = {
    'ID': [1, 2, 3, 4, 5],
    'Project Count': [5, 3, 7, 2, 4]
}
df2 = pd.DataFrame(data2)

# Merge the two datasets on 'ID'
merged_df = pd.merge(df1, df2, on='ID', how='left')

# Calculate the average Salary per project
merged_df['Salary per Project'] = merged_df['Salary'] / merged_df['Project Count']

# Display the final DataFrame
print(merged_df)

# Calculate the overall average Salary per project
average_salary_per_project = merged_df['Salary per Project'].mean()
print("\nOverall Average Salary per Project:", average_salary_per_project)

   ID     Name Department  Salary  Project Count  Salary per Project
0   1    Alice         HR    5000              5              1000.0
1   2      Bob         IT    6000              3              2000.0
2   3  Charlie      Sales    7000              7              1000.0
3   4    David         HR    8000              2              4000.0
4   5      Eve         IT    9000              4              2250.0

Overall Average Salary per Project: 2050.0

In [114]:
#Question 49 Calculate the percentage increase in Salary for each employee compared to the average Salary in their Department.

Calculate the average Salary per department using groupby() and transform('mean').
The transform() method ensures the result matches the original DataFrame size.
Calculate the percentage increase using the formula:
Percentage Increase
=
Employee Salary
−
Average Salary
Average Salary
×
100
Percentage Increase= 
Average Salary
Employee Salary−Average Salary
​
 ×100
Add this as a new column, Salary % Increase, in the DataFrame.

In [115]:
import pandas as pd

# Original dataset
data = {
    'ID': [1, 2, 3, 4, 5],
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Department': ['HR', 'IT', 'Sales', 'HR', 'IT'],
    'Salary': [5000, 6000, 7000, 8000, 9000]
}
df = pd.DataFrame(data)

# Calculate the average Salary for each Department
average_salary_by_department = df.groupby('Department')['Salary'].transform('mean')

# Calculate the percentage increase for each employee
df['% Increase from Dept Avg'] = ((df['Salary'] - average_salary_by_department) / average_salary_by_department) * 100

# Display the final DataFrame
print(df)

   ID     Name Department  Salary  % Increase from Dept Avg
0   1    Alice         HR    5000                -23.076923
1   2      Bob         IT    6000                -20.000000
2   3  Charlie      Sales    7000                  0.000000
3   4    David         HR    8000                 23.076923
4   5      Eve         IT    9000                 20.000000